# IsValidFileName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageExportOptions..::..IsValidFileName Method
ImageExportOptions Class See Also
---
Verify if File name is valid
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool IsValidFileName(
	string filePath
)
```

Visual Basic
---
```text
Public Shared Function IsValidFileName ( _
	filePath As String _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidFileName(
	String^ filePath
)
```

# ### Parameters
filePath
    Type: System..::..String File path to be tested for valid file name
# ### Return Value
True if File name is valid; false otherwise
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ImageExportOptions Class
Autodesk.Revit.DB Namespace